Autodesk.Revit.DB.Lighting.InitialWattageIntensity.Wattage
The wattage value.
The wattage value in W as a numerical value between 0 and 1e+30.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The wattage value is not valid because it is not between 0 and 1e+30.
Since:
2013

Autodesk.Revit.DB.Lighting.InitialWattageIntensity.Efficacy
The efficacy value.
The efficacy value in lm/W as a numerical value greater than 0.0 and less than 1.0e+10.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The efficacy value is not valid because it is not between 0 and 1e+30.
Since:
2013

Autodesk.Revit.DB.Lighting.InitialWattageIntensity.#ctor(Autodesk.Revit.DB.Lighting.InitialWattageIntensity)
Creates a copy of the given initial wattage intensity object
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.InitialWattageIntensity.#ctor(System.Double,System.Double)
Creates an initial wattage intensity object with the given values.
efficacy:
The universal unit efficacy value as a numerical value between 0 and 1e+30.
wattage:
The universal unit wattage value as a numerical value between 0 and 1e+30.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The efficacy value is not valid because it is not between 0 and 1e+30.
-or-
The wattage value is not valid because it is not between 0 and 1e+30.
Since:
2013

Autodesk.Revit.DB.Lighting.InitialWattageIntensity
This class encapsulates initial wattage intensity calculation.
Since:
2013